{
  "id": "books",
  "title": "Books",
  "description": "The holy bibles of user experience design!",
  "icon": "Book",
  "resources": [
    {
      "title": "100 Things Every Designer Needs to Know About People",
      "link": "https://www.amazon.com/Things-Designer-People-Voices-Matter/dp/0321767535",
      "description": "This book combines real science and research with practical examples to deliver a guide every designer needs.",
      "globalIndex": 57
    },
    {
      "title": "Creative Confidence: Unleashing the Creative Potential Within Us All",
      "link": "https://www.amazon.com/Creative-Confidence-Unleashing-Potential-Within/dp/038534936X/",
      "description": "David and Tom Kelley identify the principles and strategies that will allow us to tap into our creative potential in our work lives, and in our personal lives.",
      "globalIndex": 63
    },
    {
      "title": "Don't Make Me Think: A Common Sense Approach to Web Usability",
      "link": "https://www.amazon.com/Dont-Make-Think-Revisited-Usability/dp/0321965515",
      "description": "Witty, commonsensical, and eminently practical, it’s one of the best-loved and most recommended books on the subject.",
      "globalIndex": 58
    },
    {
      "title": "GUI Bloopers 2.0: Common User Interface Design Don'ts and Dos",
      "link": "https://www.amazon.com/GUI-Bloopers-2-0-Interactive-Technologies/dp/0123706432",
      "description": "GUI Bloopers 2.0, Second Edition, is the completely updated and revised version of GUI Bloopers.",
      "globalIndex": 59
    },
    {
      "title": "People Aren't Robots: A Practical Guide to the Psychology and Technique of Questionnaire Design",
      "link": "https://www.amazon.com/People-Arent-Robots-psychology-questionnaire/dp/1539730646",
      "description": "This book will help marketers, brand managers, and advertising executives who may have less experience in the research industry create great questionnaires and collect high quality data.",
      "globalIndex": 60
    },
    {
      "title": "Rocket Surgery Made Easy: The Do-It-Yourself Guide to Finding and Fixing Usability Problems",
      "link": "https://www.amazon.com/Rocket-Surgery-Made-Easy-Yourself/dp/0321657292",
      "description": "Using practical advice, plenty of illustrations, and his trademark humor, Steve explains how to test any design, from a sketch on a napkin to a fully-functioning web site or application.",
      "globalIndex": 61
    },
    {
      "title": "The Design of Everyday Things",
      "link": "https://www.amazon.com/gp/product/B00E257T6C/",
      "description": "Design doesn't have to complicated, which is why this guide to human-centered design shows that usability is just as important as aesthetics.",
      "globalIndex": 62
    }
  ]
}